# written by zyf in 2022/7/13 13:22
pi = 3.1415926535
# 12 占位符的格式控制
# 12.1 %占位符指定宽度
# %(n)d, %(n)s, %(n)f
#     指定宽度为n，右对齐
print("12.1", "%10d" % 10)
print("12.1", "%10s" % "aa")
print("12.1", "%10f" % pi)
# 12.2 %占位符指定浮点型的小数位数
# %.(m)f
#     指定保留m位小数，不足则补零
print("12.2", "%.2f" % pi)
print("12.2", "%10.2f" % pi)
print("12.2", "%.5f" % 69)
# 12.3 %占位符指定整型的宽度，不足补零
# %.(m)d
#     指定宽度为m，不足在前面补零
print("12.3", "%.5d" % 233)
print("12.3", "%10.3d" % pi)
# 12.4 {}占位符指定宽度
# {num/var:n}
#     指定宽度为n，字符串左对齐，数字右对齐，超过则保留原字符串
# {num/var:.n}
#     指定宽度为n，超过则截取
print("12.4", "{:10}".format("hello"))
print("12.4", "{:10}".format(3.14))
print("12.4", "{:5}".format(pi))
print("12.4", f"{pi:5}")
print("12.4", "{:.10}".format("hello"))
print("12.4", "{:.10}".format(3.14))
print("12.4", "{:.5}".format(pi))
print("12.4", f"{pi:.5}")
# 12.5 {}占位符指定浮点型的小数位数
# {num/var:.mf}
#     指定小数位数为m，不足则补零
print("12.5", "{:.10f}".format(3.14))
print("12.5", "{:.5f}".format(pi))
# 12.6 {}占位符同时指定宽度和小数位数
# {num/var:n.mf}
#     指定宽度为n，小数位数为m
print("12.6", "{:10.5f}".format(pi))
